# Voorbeeldopdracht week 7: Pivot in Pandas

Vanaf deze week worden de opdrachten bij dit vak in Python gemaakt. Aan het begin zal hierbij nog veel code voorgeschreven worden, later komt er meer ruimte om zelf code te typen. 

Jupyter Notebooks worden uitgebreider behandeld bij het vak Programming.

## Opdracht 1

Hieronder wordt een dataset ingelezen om te analyseren bij deze opdracht. 
Download hiervoor index_dataset van Brightspace en zet deze op je laptop in dezelfde map als waar je deze opdracht opslaat.

In [2]:
# Code om de pandas library in te lezen om analyses mee te doen
import pandas as pd
# Verander hieronder de locatie van de dataset
locatie = 'index.xlsx'
data = pd.read_excel(locatie)

Als je hieronder de cell uitvoert krijg je de dataset te zien. Zoals je ziet is de dataset gelijk aan de dataset van week 1

Run de cell hieronder

In [3]:
data

,Nationaal/internationaal,Soort index,Index naam,Periode,waarde
0,Nederland,euronext Amsterdam,AEX-index,1990-01-01,136.59
1,Nederland,euronext Amsterdam,AEX-index,1990-01-02,136.52
2,Nederland,euronext Amsterdam,AEX-index,1990-01-03,138.24
3,Nederland,euronext Amsterdam,AEX-index,1990-01-04,137.04
4,Nederland,euronext Amsterdam,AEX-index,1990-01-05,134.91
...,...,...,...,...,...
63711,Internationale indices,NaN,MSCI-world index,2018-12-25,1375044.00
63712,Internationale indices,NaN,MSCI-world index,2018-12-26,1417799.00
63713,Internationale indices,NaN,MSCI-world index,2018-12-27,1427729.00
63714,Internationale indices,NaN,MSCI-world index,2018-12-28,1432601.00
63715,Internationale indices,NaN,MSCI-world index,2018-12-31,1441424.00

In [4]:
data.dtypes

Nationaal/internationaal            object
Soort index                         object
Index naam                          object
Periode                     datetime64[ns]
waarde                             float64
dtype: object

In [5]:
data.shape

(63716, 5)

De output van de functie is een tuple met als eerste waarde het aantal regels van de dataset en als tweede waarde het aantal kolommen.

## Basisanalyse

Er zijn heel veel verschillende manieren om uit een tabel specifieke rijen en kolommen te selecteren en hier vervolgens data uit te halen. Dit wordt bij programming verder behandeld. Hier wordt gewerkt met .loc

In [6]:
# Selecteer de AEX index
analyse_data = data.loc[data['Index naam']=='AEX-index ', :]

Nu wordt het verschil in de AEX index tussen 1-1-1990 en 31-12-2008 berekend in de variabele 'verschil'

In [7]:
# Selecteer de waarde op 1990-01-01
waarde_1990_01_01 = analyse_data.loc[analyse_data['Periode ']=='1990-01-01', 'waarde'].values[0]
# Selecteer de waarde op 2008-12-31
waarde_2008_12_31 = analyse_data.loc[analyse_data['Periode ']=='2008-12-31', 'waarde'].values[0]
verschil = waarde_2008_12_31-waarde_1990_01_01
verschil

109.35

Zoals je ziet is een analyse in Python niet altijd sneller of makkelijker dan een analyse in Excel. Er is natuurlijk wel een groot voordeel dat wanneer bijvoorbeeld in de selectie van de index de AEX aanpast naar Dow Jones en de code eronder runt je meteen het goede antwoord krijgt op de vraag hoeveel de Dow Jones index is gestegen. In de praktijk zal je altijd zelf moeten bepalen welke methode voor de vraag het best werkt. Over het algemeen wordt aangeraden om wanneer de een activiteit vaak wil herhalen Python op de lange termijn beter werkt.

## Draaitabellen

Ook draaitabellen kunnen gemakkelijk gemaakt worden in Python. Dit doe je met het commando pivot_table. We selecteren eerst even alleen de data uit april 2006 van Nederlandse indices

In [8]:
april_2006 = data.loc[(data['Nationaal/internationaal']=='Nederland') &
                      (data['Periode '].astype('str').str.contains('2006-04')), :]

april_2006

,Nationaal/internationaal,Soort index,Index naam,Periode,waarde
4129,Nederland,euronext Amsterdam,AEX-index,2006-04-03,471.33
4130,Nederland,euronext Amsterdam,AEX-index,2006-04-04,467.95
4131,Nederland,euronext Amsterdam,AEX-index,2006-04-05,468.53
4132,Nederland,euronext Amsterdam,AEX-index,2006-04-06,469.60
4133,Nederland,euronext Amsterdam,AEX-index,2006-04-07,468.68
...,...,...,...,...,...
23774,Nederland,euronext Amsterdam,FinanciÃ«le instellingen,2006-04-24,633.04
23775,Nederland,euronext Amsterdam,FinanciÃ«le instellingen,2006-04-25,638.36
23776,Nederland,euronext Amsterdam,FinanciÃ«le instellingen,2006-04-26,637.71
23777,Nederland,euronext Amsterdam,FinanciÃ«le instellingen,2006-04-27,631.99
23778,Nederland,euronext Amsterdam,FinanciÃ«le instellingen,2006-04-28,625.58

Nu wordt een draaitabel gemaakt met in de rijen de periode en in de kolommen de index naam

In [9]:
pd.pivot_table(april_2006, index='Periode ', columns='Index naam', values='waarde')

Index naam,AEX-index,All-share index,FinanciÃ«le instellingen,Midkap-index
Periode,,,,
2006-04-03,471.33,706.21,639.00,632.24
2006-04-04,467.95,701.33,633.78,627.23
2006-04-05,468.53,702.80,633.18,627.50
2006-04-06,469.60,705.01,634.17,633.78
2006-04-07,468.68,704.24,628.71,634.93
2006-04-10,470.66,707.55,630.13,634.29
2006-04-11,464.14,698.98,618.96,625.28
2006-04-12,463.62,697.31,618.81,619.64
2006-04-13,462.76,697.00,617.13,623.26
2006-04-18,462.73,697.88,617.57,626.15
2006-04-19,468.86,706.04,626.97,632.66
2006-04-20,472.64,710.17,632.35,634.05
2006-04-21,478.00,718.12,637.51,637.19
2006-04-24,475.64,715.73,633.04,636.85
2006-04-25,476.04,716.33,638.36,638.20
2006-04-26,477.47,718.24,637.71,638.95
2006-04-27,474.44,712.17,631.99,628.40
2006-04-28,469.40,705.22,625.58,622.95

Zoals je ziet worden nu automatisch de waarden weergegeven in de draaitabel. Dit komt omdat de draaitabel standaard bij numerieke waarden de waarde optelt, omdat per periode en naam elke waarde maar 1 keer voorkomt wordt nu toevallig de goede waarde weergegeven.
We kunnen bijvoorbeeld de gemiddelde waarde per index berekenen voor alle dagen in de maand april 2006 door aggfunc als argument aan de functie toe te voegen.

In [10]:
pd.pivot_table(april_2006, index='Periode ', values='waarde', aggfunc='mean')

              waarde
Periode
2006-04-03  612.1950
2006-04-04  607.5725
2006-04-05  608.0025
2006-04-06  610.6400
2006-04-07  609.1400
2006-04-10  610.6575
2006-04-11  601.8400
2006-04-12  599.8450
2006-04-13  600.0375
2006-04-18  601.0825
2006-04-19  608.6325
2006-04-20  612.3025
2006-04-21  617.7050
2006-04-24  615.3150
2006-04-25  617.2325
2006-04-26  618.0925
2006-04-27  611.7500
2006-04-28  605.7875